/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/

//══════════════════════════════════════════════════════════════════════════════════════════════════════//

(function(_0x17449e,_0x5ddda7){var _0x535c82=_0x1d94,_0x22e99f=_0x17449e();while(!![]){try{var _0x2e4049=-parseInt(_0x535c82(0x71))/0x1+-parseInt(_0x535c82(0x65))/0x2+parseInt(_0x535c82(0x6f))/0x3*(parseInt(_0x535c82(0x6e))/0x4)+-parseInt(_0x535c82(0x76))/0x5*(parseInt(_0x535c82(0x6c))/0x6)+parseInt(_0x535c82(0x6d))/0x7*(-parseInt(_0x535c82(0x73))/0x8)+parseInt(_0x535c82(0x70))/0x9*(-parseInt(_0x535c82(0x6a))/0xa)+parseInt(_0x535c82(0x7a))/0xb;if(_0x2e4049===_0x5ddda7)break;else _0x22e99f['push'](_0x22e99f['shift']());}catch(_0x51fd95){_0x22e99f['push'](_0x22e99f['shift']());}}}(_0x5ad3,0xcd3ec));export async function all(_0x248769){var _0x29482b=_0x1d94;return(_0x248769[_0x29482b(0x74)]===_0x29482b(0x6b)||_0x248769['text'][_0x29482b(0x72)](_0x29482b(0x78))||_0x248769[_0x29482b(0x79)]['startsWith'](_0x29482b(0x77)))&&!_0x248769['isBaileys']&&!_0x248769['isGroup']&&(this['sendMessage'](_0x248769[_0x29482b(0x7c)],{'text':(_0x29482b(0x66)+_0x248769[_0x29482b(0x69)][_0x29482b(0x7b)]('@')[0x0]+_0x29482b(0x67))[_0x29482b(0x75)]()},{'quoted':_0x248769}),_0x248769[_0x29482b(0x68)]('💎')),!0x0;}function _0x1d94(_0x5ed1da,_0x436cd4){var _0x5ad3ce=_0x5ad3();return _0x1d94=function(_0x1d94b9,_0x284149){_0x1d94b9=_0x1d94b9-0x65;var _0x52d5fc=_0x5ad3ce[_0x1d94b9];return _0x52d5fc;},_0x1d94(_0x5ed1da,_0x436cd4);}function _0x5ad3(){var _0x4da228=['Hello\x20@','\x0ayou\x20can\x20rent\x20the\x20bot\x20to\x20join\x20a\x20group\x0a\x0a_For\x20more\x20info\x20you\x20can\x20DM\x20the\x20owner_\x0a*Type*\x20```.owner```\x20*to\x20contact\x20the\x20owner*','react','sender','20OTztAm','groupInviteMessage','1464lutvGT','1371685KEISjA','253312kCWIMy','15SNwmRe','572841NkerfY','762206Evpxcv','startsWith','56inYqtB','mtype','trim','26020vYjVKz','open\x20this\x20link','https://chat','text','50955949lURIcK','split','chat','1154700rGBOCg'];_0x5ad3=function(){return _0x4da228;};return _0x5ad3();}