/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/

//══════════════════════════════════════════════════════════════════════════════════════════════════════//

(function(_0x5d7a53,_0x2e7c6e){const _0x5cf91f=_0x4fd3,_0x114c30=_0x5d7a53();while(!![]){try{const _0x1b93a4=parseInt(_0x5cf91f(0x17b))/0x1+parseInt(_0x5cf91f(0x180))/0x2*(parseInt(_0x5cf91f(0x182))/0x3)+-parseInt(_0x5cf91f(0x172))/0x4+-parseInt(_0x5cf91f(0x177))/0x5+-parseInt(_0x5cf91f(0x17c))/0x6+parseInt(_0x5cf91f(0x173))/0x7+parseInt(_0x5cf91f(0x174))/0x8*(parseInt(_0x5cf91f(0x175))/0x9);if(_0x1b93a4===_0x2e7c6e)break;else _0x114c30['push'](_0x114c30['shift']());}catch(_0x23601f){_0x114c30['push'](_0x114c30['shift']());}}}(_0xb805,0x42123));function _0xb805(){const _0x1c7f5b=['isGroup','68198wQuKHE','groupLeave','15vRFFkJ','chats','data','1539248nwTSzc','2830870nEPTls','88hcYsWd','389682gnmHRz','expired','32985ZCdLcl','*\x20will\x20leave\x20the\x20group\x20\x0a\x0ayour\x20rent\x20ended','🔴\x20bye\x20bye\x20*','name','141213BQSwxW','3182160mKFLQn','chat','user'];_0xb805=function(){return _0x1c7f5b;};return _0xb805();}function _0x4fd3(_0x3cb3b6,_0x3e0570){const _0xb80597=_0xb805();return _0x4fd3=function(_0x4fd3a4,_0x313d9d){_0x4fd3a4=_0x4fd3a4-0x172;let _0xca39f7=_0xb80597[_0x4fd3a4];return _0xca39f7;},_0x4fd3(_0x3cb3b6,_0x3e0570);}export async function all(_0x5049ed){const _0xcddf90=_0x4fd3;if(!_0x5049ed[_0xcddf90(0x17f)])return;let _0x4327c5=global['db'][_0xcddf90(0x184)][_0xcddf90(0x183)][_0x5049ed['chat']];if(!_0x4327c5[_0xcddf90(0x176)])return!0x0;+new Date()>_0x4327c5[_0xcddf90(0x176)]&&(await this['reply'](_0x5049ed[_0xcddf90(0x17d)],_0xcddf90(0x179)+this[_0xcddf90(0x17e)][_0xcddf90(0x17a)]+_0xcddf90(0x178)),await this[_0xcddf90(0x181)](_0x5049ed[_0xcddf90(0x17d)]),_0x4327c5['expired']=null);}