/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/



//══════════════════════════════════════════════════════════════════════════════════════════════════════//

function _0x1368(_0x1fbcbb,_0x3f6473){const _0x389e2a=_0x389e();return _0x1368=function(_0x1368da,_0x56336a){_0x1368da=_0x1368da-0x1a3;let _0x11c69b=_0x389e2a[_0x1368da];return _0x11c69b;},_0x1368(_0x1fbcbb,_0x3f6473);}const _0x1a5705=_0x1368;(function(_0x212240,_0x5394fc){const _0x3b0b49=_0x1368,_0x7072ca=_0x212240();while(!![]){try{const _0x29e2f2=parseInt(_0x3b0b49(0x1b4))/0x1*(parseInt(_0x3b0b49(0x1a5))/0x2)+parseInt(_0x3b0b49(0x1aa))/0x3*(-parseInt(_0x3b0b49(0x1a7))/0x4)+-parseInt(_0x3b0b49(0x1ba))/0x5+parseInt(_0x3b0b49(0x1a3))/0x6*(-parseInt(_0x3b0b49(0x1ae))/0x7)+parseInt(_0x3b0b49(0x1b8))/0x8+parseInt(_0x3b0b49(0x1ad))/0x9+parseInt(_0x3b0b49(0x1a4))/0xa;if(_0x29e2f2===_0x5394fc)break;else _0x7072ca['push'](_0x7072ca['shift']());}catch(_0x184a1f){_0x7072ca['push'](_0x7072ca['shift']());}}}(_0x389e,0x34bf5));let handler=async(_0x302926,{text:_0xb06217,conn:_0xfc91a6})=>{const _0x3ea8fc=_0x1368;let _0x2b36b0=global['db'][_0x3ea8fc(0x1b7)][_0x3ea8fc(0x1a9)][_0x302926[_0x3ea8fc(0x1a6)]];_0x2b36b0['afk']=+new Date(),_0x2b36b0[_0x3ea8fc(0x1b5)]=_0xb06217,_0x302926[_0x3ea8fc(0x1b0)](_0x3ea8fc(0x1b2)+_0xfc91a6[_0x3ea8fc(0x1a8)](_0x302926['sender'])+'\x20\x0a▢\x20*Reason:*\x20'+(_0xb06217?_0xb06217:'')+_0x3ea8fc(0x1b9));};handler[_0x1a5705(0x1af)]=[_0x1a5705(0x1b6)],handler[_0x1a5705(0x1ab)]=[_0x1a5705(0x1b1)],handler['command']=[_0x1a5705(0x1ac)],handler[_0x1a5705(0x1b3)]=!![];function _0x389e(){const _0x57eef8=['1446319UWDxfC','help','reply','fun','\x0a\x20\x20😴\x20*AFK*\x20\x0aYou\x20are\x20now\x20afk\x20until\x20u\x20send\x20a\x20message\x20\x0a▢\x20*User:*\x20','group','1OlPnCs','afkReason','afk\x20<reason>','data','1475584NroEkx','\x0a\x20\x20','1432130pdQByf','6FfpEvc','6851020BJRTsX','429674thgrEG','sender','406284EDbNoV','getName','users','12CNgQzW','tags','afk','278937JPSQjL'];_0x389e=function(){return _0x57eef8;};return _0x389e();}export default handler;