/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/


//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x114e81=_0xe543;function _0xe543(_0x1346c6,_0x5cb7c4){const _0x11b632=_0x11b6();return _0xe543=function(_0xe54317,_0x5a64ad){_0xe54317=_0xe54317-0x1ed;let _0x24aac9=_0x11b632[_0xe54317];return _0x24aac9;},_0xe543(_0x1346c6,_0x5cb7c4);}(function(_0x2f5c47,_0xea1ad){const _0xdc2586=_0xe543,_0x26f2f8=_0x2f5c47();while(!![]){try{const _0x40b511=-parseInt(_0xdc2586(0x1f8))/0x1+parseInt(_0xdc2586(0x203))/0x2*(-parseInt(_0xdc2586(0x204))/0x3)+parseInt(_0xdc2586(0x202))/0x4+parseInt(_0xdc2586(0x1fb))/0x5*(parseInt(_0xdc2586(0x1f4))/0x6)+-parseInt(_0xdc2586(0x1fd))/0x7*(parseInt(_0xdc2586(0x1f1))/0x8)+-parseInt(_0xdc2586(0x1f2))/0x9+-parseInt(_0xdc2586(0x1ef))/0xa*(-parseInt(_0xdc2586(0x205))/0xb);if(_0x40b511===_0xea1ad)break;else _0x26f2f8['push'](_0x26f2f8['shift']());}catch(_0x4edcdf){_0x26f2f8['push'](_0x26f2f8['shift']());}}}(_0x11b6,0x8f4f2));import _0x4492aa from'node-fetch';const handler=async(_0x15145b,{conn:_0x3773b4})=>{const _0x381d49=_0xe543;try{const _0x35ce2a=await _0x4492aa(_0x381d49(0x1f9));if(!_0x35ce2a['ok'])throw await _0x35ce2a[_0x381d49(0x1f0)]();const _0x1adae2=await _0x35ce2a[_0x381d49(0x1f3)](),{sentence:_0xf1cb39,character:_0x5ed743,anime:_0x2c4993}=_0x1adae2,_0x5e1ea8=_0x381d49(0x1f6)+_0xf1cb39+_0x381d49(0x1ff)+_0x5ed743+_0x381d49(0x200)+_0x2c4993+'```\x0a';_0x3773b4[_0x381d49(0x1f5)](_0x15145b[_0x381d49(0x1fc)],{'text':_0x5e1ea8},_0x381d49(0x1fa),{'quoted':_0x15145b});}catch(_0x7023ff){console[_0x381d49(0x1ee)](_0x7023ff);}};function _0x11b6(){const _0x25381a=['7176520ixgnPr','2779938dNvmOo','json','6OtfexJ','sendMessage','❖𝐐𝐔𝐎𝐓𝐄\x0a','help','947960URhGow','https://some-random-api.com/animu/quote','extendedTextMessage','1103695AcpzSb','chat','7BTPhKU','command','\x0a\x0a❖𝐂𝐇𝐀𝐑𝐀𝐂𝐓𝐄𝐑:\x20```','```\x0a❖𝐀𝐍𝐈𝐌𝐄:\x20```','group','2867664GjVJjF','56482RNqxrA','36UKwfSp','35222GcAqQT','animequote','error','6690uBgitI','text'];_0x11b6=function(){return _0x25381a;};return _0x11b6();}handler[_0x114e81(0x1f7)]=[_0x114e81(0x1ed)],handler['tags']=[_0x114e81(0x201)],handler[_0x114e81(0x1fe)]=/^(animequote)$/i;export default handler;