/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/


//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x3b89e4=_0x1ae6;(function(_0x4a305f,_0x570bcf){const _0x41b6f5=_0x1ae6,_0x337d91=_0x4a305f();while(!![]){try{const _0x2593f1=parseInt(_0x41b6f5(0x1e5))/0x1+parseInt(_0x41b6f5(0x1dd))/0x2+-parseInt(_0x41b6f5(0x1e6))/0x3*(-parseInt(_0x41b6f5(0x1e4))/0x4)+parseInt(_0x41b6f5(0x1da))/0x5*(-parseInt(_0x41b6f5(0x1de))/0x6)+-parseInt(_0x41b6f5(0x1d3))/0x7*(parseInt(_0x41b6f5(0x1d8))/0x8)+-parseInt(_0x41b6f5(0x1e7))/0x9+parseInt(_0x41b6f5(0x1d2))/0xa*(-parseInt(_0x41b6f5(0x1e2))/0xb);if(_0x2593f1===_0x570bcf)break;else _0x337d91['push'](_0x337d91['shift']());}catch(_0x583abf){_0x337d91['push'](_0x337d91['shift']());}}}(_0x5727,0xdf217));import _0x326e5c from'api-dylux';const handler=async(_0x1c8588,{conn:_0x472137,args:_0x3774b9,usedPrefix:_0x1304f4,command:_0x500ad3})=>{const _0x3b8226=_0x1ae6;if(!_0x3774b9[0x0])throw _0x3b8226(0x1ea)+(_0x1304f4+_0x500ad3)+_0x3b8226(0x1e1);const _0x9b0209=/^(?:https?:\/\/)?(?:www\.)?(?:facebook\.com|fb\.watch)\b([-a-zA-Z0-9@:%_\+.~#?&//=]*)/i;if(!_0x9b0209['test'](_0x3774b9[0x0]))throw _0x3b8226(0x1e0);_0x1c8588['react'](rwait);try{const _0x29ce3a=await _0x326e5c[_0x3b8226(0x1dc)](_0x3774b9[0x0]),_0x53a491=_0x3b8226(0x1d7)+_0x29ce3a[_0x3b8226(0x1e8)]+_0x3b8226(0x1ec),_0x313300=await fetch(_0x29ce3a[_0x3b8226(0x1d6)]),_0x55a02f=await _0x313300['arrayBuffer'](),_0x56d63a=Buffer[_0x3b8226(0x1d4)](_0x55a02f);_0x472137[_0x3b8226(0x1e9)](_0x1c8588['chat'],_0x56d63a,_0x3b8226(0x1eb),_0x53a491,_0x1c8588),_0x1c8588[_0x3b8226(0x1e3)](done);}catch(_0x14b2a7){console[_0x3b8226(0x1ee)](_0x14b2a7),_0x1c8588['reply'](_0x3b8226(0x1ef));}};handler['help']=[_0x3b89e4(0x1ed)],handler[_0x3b89e4(0x1db)]=[_0x3b89e4(0x1df)],handler[_0x3b89e4(0x1d5)]=/^((facebook|fb)(downloder|dl)?)$/i,handler[_0x3b89e4(0x1d9)]=!![];function _0x1ae6(_0x4d4018,_0xa9af09){const _0x57279f=_0x5727();return _0x1ae6=function(_0x1ae64e,_0x53dd37){_0x1ae64e=_0x1ae64e-0x1d2;let _0x5d9944=_0x57279f[_0x1ae64e];return _0x5d9944;},_0x1ae6(_0x4d4018,_0xa9af09);}export default handler;function _0x5727(){const _0x267847=['command','videoUrl','\x0a⊱\x20───\x20{*\x20CYGNUS\x20FBDL*}\x20───\x20⊰\x0a↳\x20*VIDEO\x20TITLE:*\x20','15816jckYLY','diamond','10ZqzGoJ','tags','fbdl','578568HCeooU','35538LMyeVO','downloader','⚠️\x20PLEASE\x20GIVE\x20A\x20VALID\x20URL.','*\x20https://www.facebook.com/Ankursajiyaan/videos/981948876160874/?mibextid=rS40aB7S9Ucbxw6v','912241toXfIJ','react','2056676CZBZQy','899246Kgbeth','9ghkyMC','14451066JlBNAV','title','sendFile','✳️\x20Please\x20send\x20the\x20link\x20of\x20a\x20Facebook\x20video\x0a\x0a📌\x20EXAMPLE\x20:\x0a*','fb.mp4','\x0a⊱\x20──────\x20{⋆♬⋆}\x20──────\x20⊰','facebook\x20<url>','log','⚠️\x20An\x20error\x20occurred\x20while\x20processing\x20the\x20request.\x20Please\x20try\x20again\x20later.','10YYExrx','413oRgNDS','from'];_0x5727=function(){return _0x267847;};return _0x5727();}