/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/



//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x1f34e0=_0xed3c;(function(_0x54d457,_0x307f38){const _0x493937=_0xed3c,_0xf855e0=_0x54d457();while(!![]){try{const _0x136c62=parseInt(_0x493937(0x126))/0x1*(parseInt(_0x493937(0x128))/0x2)+parseInt(_0x493937(0x11b))/0x3*(parseInt(_0x493937(0x124))/0x4)+-parseInt(_0x493937(0x12c))/0x5*(parseInt(_0x493937(0x12b))/0x6)+-parseInt(_0x493937(0x129))/0x7+parseInt(_0x493937(0x120))/0x8+-parseInt(_0x493937(0x123))/0x9+-parseInt(_0x493937(0x11f))/0xa*(parseInt(_0x493937(0x12f))/0xb);if(_0x136c62===_0x307f38)break;else _0xf855e0['push'](_0xf855e0['shift']());}catch(_0x36f8ad){_0xf855e0['push'](_0xf855e0['shift']());}}}(_0x1244,0xdd140));function _0x1244(){const _0x4b2583=['command','mentionedJid','quoted','7870cOYvMM','9593120jTAhKR','user','fromMe','7162209eQMTMA','32796muAqGE','*\x0a\x0a🪙\x20*Gold*\x20:\x20','29LdDWhN','getName','108762ieRGrr','2010736xDfzGf','🟨\x20The\x20user\x20is\x20not\x20found\x20in\x20my\x20database','6ViEqMm','4565010OrmSZM','users','credit','5467sZLAww','chat','reply','data','wallet','sender','👛\x20*Wallet\x20|\x20','gold','189WDskaz'];_0x1244=function(){return _0x4b2583;};return _0x1244();}let handler=async(_0x36ec90,{conn:_0x2b18ad,usedPrefix:_0x4cdfc3})=>{const _0x5efe6f=_0xed3c;let _0x1015d7=_0x36ec90['quoted']?_0x36ec90[_0x5efe6f(0x11e)][_0x5efe6f(0x118)]:_0x36ec90['mentionedJid']&&_0x36ec90[_0x5efe6f(0x11d)][0x0]?_0x36ec90[_0x5efe6f(0x11d)][0x0]:_0x36ec90[_0x5efe6f(0x122)]?_0x2b18ad[_0x5efe6f(0x121)]['jid']:_0x36ec90['sender'],_0xb2e4d0=global['db'][_0x5efe6f(0x116)]['users'][_0x1015d7],_0x536d1e=_0x2b18ad[_0x5efe6f(0x127)](_0x1015d7);if(!(_0x1015d7 in global['db'][_0x5efe6f(0x116)][_0x5efe6f(0x12d)]))throw _0x5efe6f(0x12a);_0x2b18ad[_0x5efe6f(0x115)](_0x36ec90[_0x5efe6f(0x130)],_0x5efe6f(0x119)+_0x536d1e+_0x5efe6f(0x125)+_0xb2e4d0[_0x5efe6f(0x12e)]+'\x0a',_0x36ec90,{'mentions':[_0x1015d7]});};function _0xed3c(_0x967c62,_0x1cfd03){const _0x12441b=_0x1244();return _0xed3c=function(_0xed3c66,_0x4c2601){_0xed3c66=_0xed3c66-0x115;let _0xca7858=_0x12441b[_0xed3c66];return _0xca7858;},_0xed3c(_0x967c62,_0x1cfd03);}handler['help']=[_0x1f34e0(0x117)],handler['tags']=['economy'],handler[_0x1f34e0(0x11c)]=['wallet',_0x1f34e0(0x11a)];export default handler;