/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/


//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x4962e0=_0x189f;(function(_0x4776a7,_0x4ff24f){const _0x4b42f9=_0x189f,_0x430ace=_0x4776a7();while(!![]){try{const _0x239ada=parseInt(_0x4b42f9(0x1b6))/0x1*(parseInt(_0x4b42f9(0x19a))/0x2)+-parseInt(_0x4b42f9(0x1a8))/0x3*(parseInt(_0x4b42f9(0x196))/0x4)+-parseInt(_0x4b42f9(0x1a0))/0x5*(parseInt(_0x4b42f9(0x19e))/0x6)+-parseInt(_0x4b42f9(0x19c))/0x7+parseInt(_0x4b42f9(0x198))/0x8*(parseInt(_0x4b42f9(0x1a9))/0x9)+parseInt(_0x4b42f9(0x1b3))/0xa*(parseInt(_0x4b42f9(0x1b0))/0xb)+-parseInt(_0x4b42f9(0x195))/0xc*(-parseInt(_0x4b42f9(0x19d))/0xd);if(_0x239ada===_0x4ff24f)break;else _0x430ace['push'](_0x430ace['shift']());}catch(_0x7c49e8){_0x430ace['push'](_0x430ace['shift']());}}}(_0x1bf4,0x63b19));let handler=async(_0x67b003,{conn:_0x5b000a,args:_0x86a03f,text:_0x2a9f49,usedPrefix:_0xa6c9fc,command:_0x20e524})=>{const _0x474789=_0x189f;let _0x3b6d37=parseInt(_0x86a03f[0x0]),_0x3eddd6=_0x86a03f[0x1]?.[_0x474789(0x19b)]();if(_0x86a03f['length']<0x2)throw _0x474789(0x1b5)+(_0xa6c9fc+_0x20e524)+_0x474789(0x1a6)+(_0xa6c9fc+_0x20e524)+_0x474789(0x1ad);let _0x4137c7=[_0x474789(0x1af),_0x474789(0x197)],_0x2cfa91=_0x4137c7[Math[_0x474789(0x1b1)](Math['random']()*_0x4137c7['length'])],_0x5f240b=global['db']['data'][_0x474789(0x1b4)][_0x67b003[_0x474789(0x1ae)]];if(isNaN(_0x3b6d37)||_0x3b6d37<0x1f4)throw'✳️\x20The\x20minimum\x20bet\x20is\x20500\x20gold';if(!_0x4137c7['includes'](_0x3eddd6))throw _0x474789(0x199);if(_0x5f240b[_0x474789(0x1a4)]<_0x3b6d37)throw _0x474789(0x1ab);if(_0x3b6d37>0x186a0)throw _0x474789(0x1a2);let _0x23867e='';_0x2cfa91==_0x3eddd6?(_0x23867e=(_0x2cfa91==_0x474789(0x1af)?_0x474789(0x1a1):_0x474789(0x1aa))+'\x20\x0a\x0aYou\x20won\x20'+_0x3b6d37*0x2+_0x474789(0x1b2),_0x5f240b['credit']+=_0x3b6d37*0x2):(_0x23867e=(_0x2cfa91==_0x474789(0x1af)?_0x474789(0x1a1):_0x474789(0x1aa))+_0x474789(0x1ac)+_0x3b6d37+_0x474789(0x1b2),_0x5f240b[_0x474789(0x1a4)]-=_0x3b6d37),_0x67b003[_0x474789(0x1a5)](_0x23867e);};function _0x1bf4(){const _0x596032=['toLowerCase','1751092iqHFjZ','13316563LEfIxP','4037370Lpizjp','command','5YcLzlz','The\x20ball\x20landed\x20on\x20🔴','🟥\x20*You\x20can\x27t\x20bet\x20gold\x20more\x20than\x20100000*','roulette\x20<amount>\x20<color(red/black)>','credit','reply','\x20<amount>\x20<color>\x0a\x0a\x20Example:\x20','group','3669OcyQMm','3570948rGjFSK','The\x20ball\x20landed\x20on\x20⚫','✳️\x20You\x20do\x20not\x20have\x20enough\x20gold!','\x20\x0a\x0aYou\x20lost\x20','\x20500\x20red','sender','red','4178911JpScbq','floor','\x20gold','10oXbsnC','users','✳️\x20Command\x20Usage:\x20','4uFrzpK','economy','12aWUmOA','1712ctDxCM','black','8zfoFom','✳️\x20You\x20must\x20specify\x20a\x20valid\x20color:\x20red\x20or\x20black','26908cCTNIp'];_0x1bf4=function(){return _0x596032;};return _0x1bf4();}function _0x189f(_0x375561,_0xdb274c){const _0x1bf46a=_0x1bf4();return _0x189f=function(_0x189f8b,_0x3922fe){_0x189f8b=_0x189f8b-0x194;let _0x1ae399=_0x1bf46a[_0x189f8b];return _0x1ae399;},_0x189f(_0x375561,_0xdb274c);}handler['help']=[_0x4962e0(0x1a3)],handler['tags']=[_0x4962e0(0x194)],handler[_0x4962e0(0x19f)]=['roulette','rt'],handler[_0x4962e0(0x1a7)]=!![];export default handler;