/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/



//══════════════════════════════════════════════════════════════════════════════════════════════════════//

function _0x3472(_0x4c7094,_0x2b914f){const _0x22cb13=_0x22cb();return _0x3472=function(_0x34723a,_0x5cade8){_0x34723a=_0x34723a-0x8c;let _0x4dfda3=_0x22cb13[_0x34723a];return _0x4dfda3;},_0x3472(_0x4c7094,_0x2b914f);}const _0x4da177=_0x3472;function _0x22cb(){const _0x453006=['mentionedJid','gay.png','/canvas/overlay/gay','image','fromMe','./Cygnus.jpg','quoted','161808aTdqXY','chat','profilePictureUrl','147348FZAQfi','API','sender','sendFile','gay\x20@user','173727DtAEte','help','command','40sqkTNb','jid','188075fkXRDm','2473974PQrAaX','\x0a\x0aWho\x20wants\x20to\x20rape\x20this\x20gay☠️?\x20','user','7327728VwMdOg','getName','https://some-random-api.com','7esuUPa','4103008IJLiUF'];_0x22cb=function(){return _0x453006;};return _0x22cb();}(function(_0x3ed486,_0x3e9560){const _0x35bf80=_0x3472,_0xba2591=_0x3ed486();while(!![]){try{const _0x50833d=parseInt(_0x35bf80(0xa0))/0x1+-parseInt(_0x35bf80(0x9d))/0x2+-parseInt(_0x35bf80(0xa5))/0x3+parseInt(_0x35bf80(0xa8))/0x4*(parseInt(_0x35bf80(0x8d))/0x5)+parseInt(_0x35bf80(0x8e))/0x6*(-parseInt(_0x35bf80(0x94))/0x7)+-parseInt(_0x35bf80(0x95))/0x8+parseInt(_0x35bf80(0x91))/0x9;if(_0x50833d===_0x3e9560)break;else _0xba2591['push'](_0xba2591['shift']());}catch(_0x1c35a8){_0xba2591['push'](_0xba2591['shift']());}}}(_0x22cb,0x42d08));let handler=async(_0x5e6aa2,{conn:_0x1216cc})=>{const _0x1b4751=_0x3472;let _0x4276c9=_0x5e6aa2[_0x1b4751(0x9c)]?_0x5e6aa2[_0x1b4751(0x9c)][_0x1b4751(0xa2)]:_0x5e6aa2[_0x1b4751(0x96)]&&_0x5e6aa2[_0x1b4751(0x96)][0x0]?_0x5e6aa2[_0x1b4751(0x96)][0x0]:_0x5e6aa2[_0x1b4751(0x9a)]?_0x1216cc[_0x1b4751(0x90)][_0x1b4751(0x8c)]:_0x5e6aa2['sender'],_0x5d340c=_0x1216cc[_0x1b4751(0x92)](_0x4276c9),_0x6d463d=await _0x1216cc[_0x1b4751(0x9f)](_0x4276c9,_0x1b4751(0x99))['catch'](_0x473249=>_0x1b4751(0x9b));_0x1216cc[_0x1b4751(0xa3)](_0x5e6aa2[_0x1b4751(0x9e)],global[_0x1b4751(0xa1)](_0x1b4751(0x93),_0x1b4751(0x98),{'avatar':_0x6d463d}),_0x1b4751(0x97),'🏳️‍🌈\x20\x20*Gay\x20:*\x20'+_0x5d340c+_0x1b4751(0x8f),_0x5e6aa2);};handler[_0x4da177(0xa6)]=[_0x4da177(0xa4)],handler['tags']=['fun'],handler[_0x4da177(0xa7)]=['gay'];export default handler;