/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

function _0x2bc8(_0x5e8bf8,_0x8d5dcc){const _0x72fc12=_0x72fc();return _0x2bc8=function(_0x2bc866,_0x2065b7){_0x2bc866=_0x2bc866-0xc3;let _0x548f59=_0x72fc12[_0x2bc866];return _0x548f59;},_0x2bc8(_0x5e8bf8,_0x8d5dcc);}const _0x1fdd5f=_0x2bc8;(function(_0x2e4e21,_0x5c525b){const _0x9de988=_0x2bc8,_0x427f28=_0x2e4e21();while(!![]){try{const _0x5d28ec=parseInt(_0x9de988(0xd0))/0x1*(-parseInt(_0x9de988(0xcf))/0x2)+-parseInt(_0x9de988(0xd6))/0x3+parseInt(_0x9de988(0xd4))/0x4+parseInt(_0x9de988(0xd2))/0x5*(-parseInt(_0x9de988(0xc6))/0x6)+-parseInt(_0x9de988(0xcc))/0x7+parseInt(_0x9de988(0xd3))/0x8*(parseInt(_0x9de988(0xce))/0x9)+parseInt(_0x9de988(0xd5))/0xa*(parseInt(_0x9de988(0xcd))/0xb);if(_0x5d28ec===_0x5c525b)break;else _0x427f28['push'](_0x427f28['shift']());}catch(_0x28ed49){_0x427f28['push'](_0x427f28['shift']());}}}(_0x72fc,0xd7090));let toM=_0x21ebd6=>'@'+_0x21ebd6[_0x1fdd5f(0xca)]('@')[0x0];function handler(_0x39eebb,{groupMetadata:_0xddd56f}){const _0xabe711=_0x1fdd5f;let _0x3085f5=_0xddd56f['participants']['map'](_0x3d9584=>_0x3d9584['id']),_0x4c1c76=_0x39eebb['sender'],_0x5aea1e;do _0x5aea1e=_0x3085f5[_0xabe711(0xcb)]();while(_0x5aea1e===_0x4c1c76);_0x39eebb['reply'](toM(_0x4c1c76)+_0xabe711(0xc9)+toM(_0x5aea1e)+_0xabe711(0xc3),null,{'mentions':[_0x4c1c76,_0x5aea1e]});}handler[_0x1fdd5f(0xc5)]=[_0x1fdd5f(0xd1)],handler[_0x1fdd5f(0xd7)]=[_0x1fdd5f(0xc4)],handler[_0x1fdd5f(0xc8)]=[_0x1fdd5f(0xd1)],handler[_0x1fdd5f(0xc7)]=!![];function _0x72fc(){const _0x5a4f79=['3114164hjoYpO','17590730HXxZGv','5194146LaAURU','tags','\x0aCongratulations\x20💖🍻','fun','help','240BNluHM','group','command','\x20❤️\x20','split','getRandom','239953ssujey','11khWiKJ','9LZmxVj','8jyuAZr','2238rIinux','ship','61405npppiZ','4872184VdSsiQ'];_0x72fc=function(){return _0x5a4f79;};return _0x72fc();}export default handler;