/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x3ef3c4=_0x4ae8;(function(_0x544e87,_0x86e6fa){const _0x20f0f6=_0x4ae8,_0x3e6fb4=_0x544e87();while(!![]){try{const _0x40908d=parseInt(_0x20f0f6(0x121))/0x1+-parseInt(_0x20f0f6(0x11e))/0x2*(-parseInt(_0x20f0f6(0x12e))/0x3)+parseInt(_0x20f0f6(0x12a))/0x4*(-parseInt(_0x20f0f6(0x12f))/0x5)+-parseInt(_0x20f0f6(0x130))/0x6+parseInt(_0x20f0f6(0x122))/0x7+parseInt(_0x20f0f6(0x129))/0x8+parseInt(_0x20f0f6(0x132))/0x9*(-parseInt(_0x20f0f6(0x11c))/0xa);if(_0x40908d===_0x86e6fa)break;else _0x3e6fb4['push'](_0x3e6fb4['shift']());}catch(_0x4de058){_0x3e6fb4['push'](_0x3e6fb4['shift']());}}}(_0x1d0c,0xd08f1));function _0x4ae8(_0x5b8e26,_0xd87bed){const _0x1d0cad=_0x1d0c();return _0x4ae8=function(_0x4ae863,_0x4a957b){_0x4ae863=_0x4ae863-0x11b;let _0x5cff50=_0x1d0cad[_0x4ae863];return _0x5cff50;},_0x4ae8(_0x5b8e26,_0xd87bed);}import _0x225280 from'node-fetch';let handler=async(_0x2c1d1f,{text:_0x225cf4,usedPrefix:_0x5e1153,command:_0x4d47f0})=>{const _0x2e9ad2=_0x4ae8;if(!_0x225cf4)throw _0x2e9ad2(0x125)+(_0x5e1153+_0x4d47f0)+_0x2e9ad2(0x126);_0x2c1d1f[_0x2e9ad2(0x12c)]('🫣'),conn[_0x2e9ad2(0x127)](_0x2e9ad2(0x124),_0x2c1d1f[_0x2e9ad2(0x133)]);let _0x5eb44e=await _0x225280(_0x2e9ad2(0x11d)+encodeURIComponent(_0x225cf4)+_0x2e9ad2(0x11b)),_0x10e2fb=await _0x5eb44e[_0x2e9ad2(0x123)]();if(_0x10e2fb&&_0x10e2fb[_0x2e9ad2(0x131)]){const _0x52b699=_0x10e2fb[_0x2e9ad2(0x131)];_0x2c1d1f[_0x2e9ad2(0x12b)](_0x2e9ad2(0x12d)+_0x225cf4+_0x2e9ad2(0x128)+_0x52b699);}else throw _0x2e9ad2(0x120);};function _0x1d0c(){const _0x1da7a2=['10SrLRwo','fun','No\x20valid\x20response\x20received\x20from\x20the\x20API.','1473850YRmAmz','8914122RcNXQq','json','composing','✳️\x20*Example:*\x0a\x0a*','*\x20Am\x20I\x20ugly?','sendPresenceUpdate','\x0a▢\x20*Answer:*\x20','4924768AoMedQ','1089916DyRqQd','reply','react','≡\x20*RESPONSE*\x0a\x20\x20\x20\x20\x0a▢\x20*Question:*\x20','486537cUOKFp','10MqaKlU','9759600UKAzTx','data','2582937eKnZyb','chat','question','&model=llama','40KTCmVA','https://gurugpt.cyclic.app/gpt4?prompt='];_0x1d0c=function(){return _0x1da7a2;};return _0x1d0c();}handler['help']=[_0x3ef3c4(0x134)],handler['tags']=[_0x3ef3c4(0x11f)],handler['command']=[_0x3ef3c4(0x134),'q'];export default handler;