/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/



//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x33e825=_0x387f;(function(_0x5ee13e,_0x59afa1){const _0x27ff8d=_0x387f,_0x5cd003=_0x5ee13e();while(!![]){try{const _0x270337=parseInt(_0x27ff8d(0x16b))/0x1+parseInt(_0x27ff8d(0x179))/0x2+-parseInt(_0x27ff8d(0x173))/0x3+-parseInt(_0x27ff8d(0x16c))/0x4*(-parseInt(_0x27ff8d(0x17c))/0x5)+-parseInt(_0x27ff8d(0x178))/0x6+-parseInt(_0x27ff8d(0x17d))/0x7+parseInt(_0x27ff8d(0x175))/0x8*(parseInt(_0x27ff8d(0x16f))/0x9);if(_0x270337===_0x59afa1)break;else _0x5cd003['push'](_0x5cd003['shift']());}catch(_0x2dff48){_0x5cd003['push'](_0x5cd003['shift']());}}}(_0x4338,0xf3a2d));function _0x387f(_0x27df85,_0x346a21){const _0x4338f8=_0x4338();return _0x387f=function(_0x387f82,_0x4bf216){_0x387f82=_0x387f82-0x168;let _0x1a5214=_0x4338f8[_0x387f82];return _0x1a5214;},_0x387f(_0x27df85,_0x346a21);}function _0x4338(){const _0x82deaa=['3452982vbprdT','559936mWUJky','tags','game','10mvgUQb','11773580dlhAmT','chat','command','startsWith','delttt','1356433tFYIwh','2562248Glcawg','reply','tictactoe','129951MydJzg','includes','values','✅\x20The\x20session\x20of\x20*tictactoe\x20is\x20restarted\x20🎮*','1672119dMAJuu','playerX','496LUOviw','help','delttc'];_0x4338=function(){return _0x82deaa;};return _0x4338();}let handler=async(_0x225028,{conn:_0x4ba8f5,text:_0x4664a1})=>{const _0x154331=_0x387f;let _0x2f7e4c=Object[_0x154331(0x171)](_0x4ba8f5[_0x154331(0x17b)])['find'](_0x50ed50=>_0x50ed50['id'][_0x154331(0x169)](_0x154331(0x16e))&&[_0x50ed50[_0x154331(0x17b)][_0x154331(0x174)],_0x50ed50['game']['playerO']][_0x154331(0x170)](_0x225028['sender']));if(_0x2f7e4c==undefined)return _0x4ba8f5['reply'](_0x225028[_0x154331(0x17e)],'✳️\x20You\x20are\x20not\x20in\x20game\x20of\x20TicTacToe\x20🎮\x20',_0x225028);delete _0x4ba8f5['game'][_0x2f7e4c['id']],await _0x4ba8f5[_0x154331(0x16d)](_0x225028[_0x154331(0x17e)],_0x154331(0x172),_0x225028);};handler[_0x33e825(0x176)]=[_0x33e825(0x16a)],handler[_0x33e825(0x17a)]=['game'],handler[_0x33e825(0x168)]=[_0x33e825(0x177),_0x33e825(0x16a),'delxo'];export default handler;