/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x549d9d=_0x5374;(function(_0x1fc2ed,_0x43d997){const _0x19f990=_0x5374,_0x3d7b79=_0x1fc2ed();while(!![]){try{const _0x7cde3f=parseInt(_0x19f990(0x8a))/0x1*(parseInt(_0x19f990(0x89))/0x2)+-parseInt(_0x19f990(0x76))/0x3*(-parseInt(_0x19f990(0x6f))/0x4)+-parseInt(_0x19f990(0x82))/0x5*(parseInt(_0x19f990(0x6d))/0x6)+-parseInt(_0x19f990(0x8b))/0x7+-parseInt(_0x19f990(0x88))/0x8*(parseInt(_0x19f990(0x77))/0x9)+parseInt(_0x19f990(0x7f))/0xa+-parseInt(_0x19f990(0x7d))/0xb*(-parseInt(_0x19f990(0x83))/0xc);if(_0x7cde3f===_0x43d997)break;else _0x3d7b79['push'](_0x3d7b79['shift']());}catch(_0x43e63f){_0x3d7b79['push'](_0x3d7b79['shift']());}}}(_0x448b,0x9ee5b));let handler=async(_0x586c01,{conn:_0x28d49a,text:_0x1e1b15,usedPrefix:_0x69a197,command:_0x6a292b})=>{const _0x5785c8=_0x5374;let _0x1e71cc=0x12c,_0x31cd80=_0x5785c8(0x8d)+(_0x69a197+_0x6a292b)+_0x5785c8(0x8e);if(!_0x1e1b15)throw _0x31cd80;var _0x56efd6=Math[_0x5785c8(0x7b)]();if(_0x56efd6<0.34)_0x56efd6='rock';else _0x56efd6>0.34&&_0x56efd6<0.67?_0x56efd6=_0x5785c8(0x74):_0x56efd6=_0x5785c8(0x91);if(_0x1e1b15==_0x56efd6)global['db'][_0x5785c8(0x75)][_0x5785c8(0x85)][_0x586c01[_0x5785c8(0x81)]][_0x5785c8(0x6b)]+=0x64,_0x586c01[_0x5785c8(0x6e)](_0x5785c8(0x72)+_0x1e1b15+'\x0a‣\x20CYGNUS\x20:\x20'+_0x56efd6+_0x5785c8(0x6c));else{if(_0x1e1b15==_0x5785c8(0x8f))_0x56efd6==_0x5785c8(0x74)?(global['db'][_0x5785c8(0x75)]['users'][_0x586c01[_0x5785c8(0x81)]]['exp']+=0x12c,_0x586c01['reply']('▢\x20*Won*\x20🎊\x0a\x0a‣\x20You\x20:\x20'+_0x1e1b15+'\x0a‣\x20CYGNUS\x20:\x20'+_0x56efd6+_0x5785c8(0x87)+_0x1e71cc+_0x5785c8(0x7e))):(global['db'][_0x5785c8(0x75)][_0x5785c8(0x85)][_0x586c01[_0x5785c8(0x81)]][_0x5785c8(0x6b)]-=0x12c,_0x586c01['reply'](_0x5785c8(0x86)+_0x1e1b15+_0x5785c8(0x78)+_0x56efd6+'\x0a\x0a\x20Points\x20*-'+_0x1e71cc+_0x5785c8(0x7e)));else{if(_0x1e1b15==_0x5785c8(0x74))_0x56efd6==_0x5785c8(0x91)?(global['db'][_0x5785c8(0x75)][_0x5785c8(0x85)][_0x586c01['sender']][_0x5785c8(0x6b)]+=0x12c,_0x586c01[_0x5785c8(0x6e)](_0x5785c8(0x90)+_0x1e1b15+_0x5785c8(0x78)+_0x56efd6+_0x5785c8(0x87)+_0x1e71cc+'\x20XP*')):(global['db']['data'][_0x5785c8(0x85)][_0x586c01[_0x5785c8(0x81)]][_0x5785c8(0x6b)]-=0x12c,_0x586c01[_0x5785c8(0x6e)]('▢\x20*lost*\x0a\x0a‣\x20You\x20:\x20'+_0x1e1b15+_0x5785c8(0x78)+_0x56efd6+_0x5785c8(0x70)+_0x1e71cc+_0x5785c8(0x7e)));else{if(_0x1e1b15==_0x5785c8(0x91))_0x56efd6==_0x5785c8(0x8f)?(global['db'][_0x5785c8(0x75)][_0x5785c8(0x85)][_0x586c01[_0x5785c8(0x81)]][_0x5785c8(0x6b)]+=0x12c,_0x586c01['reply'](_0x5785c8(0x90)+_0x1e1b15+_0x5785c8(0x78)+_0x56efd6+_0x5785c8(0x87)+_0x1e71cc+_0x5785c8(0x7e))):(global['db'][_0x5785c8(0x75)][_0x5785c8(0x85)][_0x586c01[_0x5785c8(0x81)]][_0x5785c8(0x6b)]-=0x12c,_0x586c01[_0x5785c8(0x6e)](_0x5785c8(0x7c)+_0x1e1b15+'\x0a‣\x20CYGNUS\x20:\x20'+_0x56efd6+_0x5785c8(0x70)+_0x1e71cc+_0x5785c8(0x7e)));else throw _0x31cd80;}}}};handler[_0x549d9d(0x73)]=[_0x549d9d(0x7a)],handler[_0x549d9d(0x84)]=[_0x549d9d(0x8c)],handler[_0x549d9d(0x71)]=[_0x549d9d(0x80)],handler[_0x549d9d(0x79)]=![];function _0x448b(){const _0x11fe13=['command','▢\x20*A\x20tie*\x0a\x0a‣\x20You\x20:\x20','help','scissors','data','3SieuXo','333eQohzk','\x0a‣\x20CYGNUS\x20:\x20','register','ppt\x20<rock/paper/scissors>','random','▢\x20*You\x20lost*\x0a\x0a‣\x20You\x20:\x20','11NIVhof','\x20XP*','4510420FqWYbP','ppt','sender','152990CYxAsk','13627356QhzTMh','tags','users','▢\x20*lost*\x0a\x0a‣\x20You\x20:\x20','\x0a\x0a🎁\x20Points\x20*+','19336kIrxEr','36FoxIAr','10834eCNAff','1167110MAygei','game','✳️\x20Select\x20rock/paper/scissors\x0a\x0aExample\x20:\x20*','*\x20paper\x0a','rock','▢\x20*won*\x20🎊\x0a\x0a‣\x20You\x20:\x20','paper','exp','\x0a\x0a🎁\x20Points\x20(±)100\x20XP','246RRkyWe','reply','1519412kazxcW','\x0a\x0aPoints\x20*-'];_0x448b=function(){return _0x11fe13;};return _0x448b();}function _0x5374(_0x2c8a03,_0x3ed7fa){const _0x448ba4=_0x448b();return _0x5374=function(_0x537410,_0x5b919e){_0x537410=_0x537410-0x6b;let _0x2eeae0=_0x448ba4[_0x537410];return _0x2eeae0;},_0x5374(_0x2c8a03,_0x3ed7fa);}export default handler;