/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

function _0x554f(_0x38fa04,_0x553503){const _0x2326fe=_0x2326();return _0x554f=function(_0x554f94,_0x50db6c){_0x554f94=_0x554f94-0x1e1;let _0x3b2847=_0x2326fe[_0x554f94];return _0x3b2847;},_0x554f(_0x38fa04,_0x553503);}function _0x2326(){const _0x406530=['6xwGKuJ','261pBPlOJ','resetlink','✅\x20Group\x20link\x20has\x20been\x20successfully\x20reset\x0a\x0a📌\x20new\x20link:\x0ahttps://chat.whatsapp.com/','87741SZEdag','18365424vTpnfA','2186305wwTFvW','botAdmin','10gznUBz','chat','2877354OSQKtR','4718441GmmPXS','58480OBKpQi','command','tags','revoke','groupRevokeInvite','help','reply','10GHGSxf','group','admin','377134LrQZhd','992WnNUfJ'];_0x2326=function(){return _0x406530;};return _0x2326();}const _0x31a4c6=_0x554f;(function(_0x4a274a,_0x3e6721){const _0x13e135=_0x554f,_0x179f8a=_0x4a274a();while(!![]){try{const _0x2f3693=-parseInt(_0x13e135(0x1f3))/0x1*(-parseInt(_0x13e135(0x1f5))/0x2)+-parseInt(_0x13e135(0x1f6))/0x3*(-parseInt(_0x13e135(0x1e9))/0x4)+-parseInt(_0x13e135(0x1e5))/0x5*(parseInt(_0x13e135(0x1e7))/0x6)+-parseInt(_0x13e135(0x1e8))/0x7+-parseInt(_0x13e135(0x1f4))/0x8*(-parseInt(_0x13e135(0x1e1))/0x9)+-parseInt(_0x13e135(0x1f0))/0xa*(-parseInt(_0x13e135(0x1e3))/0xb)+-parseInt(_0x13e135(0x1e2))/0xc;if(_0x2f3693===_0x3e6721)break;else _0x179f8a['push'](_0x179f8a['shift']());}catch(_0x30deb0){_0x179f8a['push'](_0x179f8a['shift']());}}}(_0x2326,0x9e0ac));let handler=async(_0x47ac3b,{conn:_0x436c99})=>{const _0x206e37=_0x554f;let _0x50b020=await _0x436c99[_0x206e37(0x1ed)](_0x47ac3b[_0x206e37(0x1e6)]);_0x47ac3b[_0x206e37(0x1ef)](_0x206e37(0x1f8)+_0x50b020);};handler[_0x31a4c6(0x1ee)]=[_0x31a4c6(0x1f7)],handler[_0x31a4c6(0x1eb)]=[_0x31a4c6(0x1f1)],handler[_0x31a4c6(0x1ea)]=[_0x31a4c6(0x1ec),_0x31a4c6(0x1f7),'anularlink'],handler[_0x31a4c6(0x1f1)]=!![],handler[_0x31a4c6(0x1f2)]=!![],handler[_0x31a4c6(0x1e4)]=!![];export default handler;