/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

function _0x39d2(_0x496d27,_0x2889c1){const _0x3d76a8=_0x3d76();return _0x39d2=function(_0x39d201,_0x3d66d0){_0x39d201=_0x39d201-0x172;let _0x323771=_0x3d76a8[_0x39d201];return _0x323771;},_0x39d2(_0x496d27,_0x2889c1);}const _0x582cec=_0x39d2;function _0x3d76(){const _0x27a179=['\x0a*▢\x20\x20Pinterest:*\x20\x20','✳️\x20What\x20image\x20do\x20you\x20want\x20me\x20to\x20look\x20for?\x0a\x0a📌\x20Example\x20\x20:\x20','1201749kCJitL','sendFile','pinterest','2ViWqGz','651070SdEqwg','5877sMwUIy','11260yzelVy','img','10719048YKVONu','24eGzfJJ','99QPKJCF','command','324996TqwOpe','324812aFQQLc','641785TPRvWV','52xuoXCo','tags','pinterest.jpg','chat'];_0x3d76=function(){return _0x27a179;};return _0x3d76();}(function(_0x5197c1,_0x383683){const _0x3bb809=_0x39d2,_0x517630=_0x5197c1();while(!![]){try{const _0x32e798=parseInt(_0x3bb809(0x17c))/0x1+-parseInt(_0x3bb809(0x172))/0x2*(parseInt(_0x3bb809(0x184))/0x3)+parseInt(_0x3bb809(0x17e))/0x4*(-parseInt(_0x3bb809(0x17d))/0x5)+-parseInt(_0x3bb809(0x178))/0x6*(-parseInt(_0x3bb809(0x173))/0x7)+parseInt(_0x3bb809(0x177))/0x8+-parseInt(_0x3bb809(0x174))/0x9*(-parseInt(_0x3bb809(0x175))/0xa)+parseInt(_0x3bb809(0x179))/0xb*(parseInt(_0x3bb809(0x17b))/0xc);if(_0x32e798===_0x383683)break;else _0x517630['push'](_0x517630['shift']());}catch(_0x55ea16){_0x517630['push'](_0x517630['shift']());}}}(_0x3d76,0xe7166));import{pinterest}from'@bochilteam/scraper';let handler=async(_0xa62032,{conn:_0x1a84e0,text:_0xbae05d,usedPrefix:_0xa6701e,command:_0x2ceb6e})=>{const _0x55b796=_0x39d2;if(!_0xbae05d)throw _0x55b796(0x183)+(_0xa6701e+_0x2ceb6e)+'\x20Lil\x20Peep';const _0x1f2b42=await pinterest(_0xbae05d);_0x1a84e0[_0x55b796(0x185)](_0xa62032[_0x55b796(0x181)],_0x1f2b42['getRandom'](),_0x55b796(0x180),(_0x55b796(0x182)+_0xbae05d+'\x0a')['trim'](),_0xa62032);};handler['help']=[_0x582cec(0x186)],handler[_0x582cec(0x17f)]=[_0x582cec(0x176)],handler[_0x582cec(0x17a)]=['pinterest'];export default handler;