/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/



//══════════════════════════════════════════════════════════════════════════════════════════════════════//

function _0x3640(){const _0x5ce8d1=['1216UOBWUk','mentionedJid','lolicon','profilePictureUrl','error.png','image','*🚔🚨\x20𝐋𝐎𝐋𝐈𝐂𝐎𝐍𝐒\x20like\x20you\x20only\x20belong\x20in\x20jail\x20🚨🚔*','5427556ldcPlz','API','1150WZiqix','7586766tdKorJ','user','1529jZExGj','61341eudEKH','command','tags','maker','catch','1894330AfUgjU','2746260HQClsU','quoted','sendFile','3zuApPc','9WyZNFs','chat','7367172oexrlM','fromMe'];_0x3640=function(){return _0x5ce8d1;};return _0x3640();}const _0x40b488=_0x1415;function _0x1415(_0x530773,_0x2de72d){const _0x36400c=_0x3640();return _0x1415=function(_0x141531,_0x11d769){_0x141531=_0x141531-0x6b;let _0x1111ec=_0x36400c[_0x141531];return _0x1111ec;},_0x1415(_0x530773,_0x2de72d);}(function(_0x426f82,_0x44b94d){const _0x3cbb01=_0x1415,_0x533501=_0x426f82();while(!![]){try{const _0x22a137=-parseInt(_0x3cbb01(0x80))/0x1*(-parseInt(_0x3cbb01(0x7d))/0x2)+parseInt(_0x3cbb01(0x6f))/0x3*(parseInt(_0x3cbb01(0x7b))/0x4)+-parseInt(_0x3cbb01(0x6c))/0x5+parseInt(_0x3cbb01(0x72))/0x6+-parseInt(_0x3cbb01(0x81))/0x7*(parseInt(_0x3cbb01(0x74))/0x8)+-parseInt(_0x3cbb01(0x70))/0x9*(parseInt(_0x3cbb01(0x6b))/0xa)+-parseInt(_0x3cbb01(0x7e))/0xb;if(_0x22a137===_0x44b94d)break;else _0x533501['push'](_0x533501['shift']());}catch(_0x44f9a7){_0x533501['push'](_0x533501['shift']());}}}(_0x3640,0xabc47));let handler=async(_0x1afe10,{conn:_0x2444e9})=>{const _0x5bb487=_0x1415;let _0x20b38d=_0x1afe10[_0x5bb487(0x6d)]?_0x1afe10[_0x5bb487(0x6d)]['sender']:_0x1afe10[_0x5bb487(0x75)]&&_0x1afe10[_0x5bb487(0x75)][0x0]?_0x1afe10[_0x5bb487(0x75)][0x0]:_0x1afe10[_0x5bb487(0x73)]?_0x2444e9[_0x5bb487(0x7f)]['jid']:_0x1afe10['sender'];_0x2444e9[_0x5bb487(0x6e)](_0x1afe10[_0x5bb487(0x71)],global[_0x5bb487(0x7c)]('https://some-random-api.com','/canvas/misc/lolice',{'avatar':await _0x2444e9[_0x5bb487(0x77)](_0x20b38d,_0x5bb487(0x79))[_0x5bb487(0x85)](_0x2a43d0=>'https://telegra.ph/file/24fa902ead26340f3df2c.png')}),_0x5bb487(0x78),_0x5bb487(0x7a),_0x1afe10);};handler['help']=[_0x40b488(0x76)],handler[_0x40b488(0x83)]=[_0x40b488(0x84)],handler[_0x40b488(0x82)]=/^(lolicon)$/i;export default handler;