/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/


//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x12aa93=_0x9a35;(function(_0x25cbb9,_0x1904f7){const _0x282c79=_0x9a35,_0x529183=_0x25cbb9();while(!![]){try{const _0x16055d=-parseInt(_0x282c79(0x1b3))/0x1+parseInt(_0x282c79(0x1b0))/0x2*(parseInt(_0x282c79(0x1bc))/0x3)+-parseInt(_0x282c79(0x1bd))/0x4+-parseInt(_0x282c79(0x1b2))/0x5*(-parseInt(_0x282c79(0x1ad))/0x6)+-parseInt(_0x282c79(0x1b5))/0x7*(parseInt(_0x282c79(0x1ae))/0x8)+-parseInt(_0x282c79(0x1b1))/0x9+parseInt(_0x282c79(0x1c0))/0xa;if(_0x16055d===_0x1904f7)break;else _0x529183['push'](_0x529183['shift']());}catch(_0x1572f8){_0x529183['push'](_0x529183['shift']());}}}(_0x2b57,0x299da));function _0x2b57(){const _0x40c091=['59824ZVSEMQ','data','chat','2639920vHcAyo','\x20@user','tags','\x0a✅\x20BANNED\x0a\x0a───────────\x0a@','12tfrmcm','110984AtGRfK','users','40232NTXRLU','2556288YAeaxv','791970xJEstX','147405NlgYZo','quoted','63nqOvph','\x20you\x20will\x20no\x20longer\x20be\x20able\x20to\x20use\x20my\x20commands\x20','mentionedJid','rowner','isGroup','ban\x20@user','command','24EPfzWm'];_0x2b57=function(){return _0x40c091;};return _0x2b57();}let handler=async(_0x32bd84,{conn:_0x403702,text:_0x2a4e89,usedPrefix:_0x1fe0d2,command:_0x4526c2})=>{const _0x124224=_0x9a35;let _0x341e63;if(_0x32bd84[_0x124224(0x1b9)])_0x341e63=_0x32bd84[_0x124224(0x1b7)][0x0]?_0x32bd84['mentionedJid'][0x0]:_0x32bd84[_0x124224(0x1b4)]?_0x32bd84[_0x124224(0x1b4)]['sender']:![];else _0x341e63=_0x32bd84[_0x124224(0x1bf)];let _0x8fb69d=global['db'][_0x124224(0x1be)][_0x124224(0x1af)][_0x341e63];if(!_0x341e63)throw'✳️\x20Tag\x20or\x20mention\x20someone\x0a\x0a📌\x20Example\x20:\x20'+(_0x1fe0d2+_0x4526c2)+_0x124224(0x1c1);let _0x3c7602=global['db'][_0x124224(0x1be)][_0x124224(0x1af)];_0x3c7602[_0x341e63]['banned']=!![],_0x403702['reply'](_0x32bd84[_0x124224(0x1bf)],_0x124224(0x1c3)+_0x341e63['split']`@`[0x0]+_0x124224(0x1b6),_0x32bd84,{'mentions':[_0x341e63]});};function _0x9a35(_0x43f5d5,_0x11503e){const _0x2b57f0=_0x2b57();return _0x9a35=function(_0x9a35e1,_0x42a0d1){_0x9a35e1=_0x9a35e1-0x1ad;let _0xd9584d=_0x2b57f0[_0x9a35e1];return _0xd9584d;},_0x9a35(_0x43f5d5,_0x11503e);}handler['help']=[_0x12aa93(0x1ba)],handler[_0x12aa93(0x1c2)]=['owner'],handler[_0x12aa93(0x1bb)]=/^ban$/i,handler[_0x12aa93(0x1b8)]=!![];export default handler;