/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x5f30a4=_0x5594;(function(_0x40e0d5,_0x6055a6){const _0x437871=_0x5594,_0x15bee7=_0x40e0d5();while(!![]){try{const _0x4d94d=-parseInt(_0x437871(0x114))/0x1+parseInt(_0x437871(0x125))/0x2+parseInt(_0x437871(0x120))/0x3*(-parseInt(_0x437871(0x128))/0x4)+parseInt(_0x437871(0x127))/0x5*(-parseInt(_0x437871(0x121))/0x6)+-parseInt(_0x437871(0x117))/0x7*(-parseInt(_0x437871(0x10e))/0x8)+parseInt(_0x437871(0x11e))/0x9*(-parseInt(_0x437871(0x11c))/0xa)+parseInt(_0x437871(0x110))/0xb*(parseInt(_0x437871(0x11f))/0xc);if(_0x4d94d===_0x6055a6)break;else _0x15bee7['push'](_0x15bee7['shift']());}catch(_0x150105){_0x15bee7['push'](_0x15bee7['shift']());}}}(_0x3c0e,0xdd49b));function _0x5594(_0x5431cd,_0x100e95){const _0x3c0e9b=_0x3c0e();return _0x5594=function(_0x55944f,_0x293ef9){_0x55944f=_0x55944f-0x10d;let _0x2f34b8=_0x3c0e9b[_0x55944f];return _0x2f34b8;},_0x5594(_0x5431cd,_0x100e95);}let handler=async(_0x5dd7f3,{conn:_0x175d0d,text:_0xf15095,usedPrefix:_0x57d5df,command:_0x4b8ac1})=>{const _0x58fdd6=_0x5594;let _0x4b45cb;if(_0x5dd7f3[_0x58fdd6(0x11d)])_0x4b45cb=_0x5dd7f3[_0x58fdd6(0x12c)][0x0]?_0x5dd7f3[_0x58fdd6(0x12c)][0x0]:_0x5dd7f3[_0x58fdd6(0x122)]?_0x5dd7f3['quoted']['sender']:![];else _0x4b45cb=_0x5dd7f3[_0x58fdd6(0x126)];let _0x23ae6e=global['db'][_0x58fdd6(0x12d)][_0x58fdd6(0x129)][_0x4b45cb];if(!_0x4b45cb)throw _0x58fdd6(0x12a)+(_0x57d5df+_0x4b8ac1)+_0x58fdd6(0x113);if(global[_0x58fdd6(0x112)][_0x58fdd6(0x124)](_0x4b45cb['split']`@`[0x0]))throw'The\x20user\x20Mentioned\x20is\x20already\x20allowed\x20to\x20use\x20the\x20bot\x20in\x20DM\x20';global[_0x58fdd6(0x112)][_0x58fdd6(0x11a)](''+_0x4b45cb[_0x58fdd6(0x115)]`@`[0x0]),_0x175d0d[_0x58fdd6(0x116)](_0x5dd7f3[_0x58fdd6(0x126)],'\x20@'+_0x4b45cb[_0x58fdd6(0x115)]`@`[0x0]+_0x58fdd6(0x123),_0x5dd7f3,{'mentions':[_0x4b45cb]});};function _0x3c0e(){const _0x3f0664=['2333820gdALVf','chat','363815DFWFuf','4KJGTEV','users','✳️\x20Tag\x20or\x20mention\x20someone\x0a\x0a📌\x20Example\x20:\x20','rowner','mentionedJid','data','allow\x20<@tag>','824672sqjYSi','command','22707729GKhffi','help','allowed','\x20@user','1230348jWpZxs','split','reply','70wyRdTq','tags','group','push','allow','10IHhlwH','isGroup','13439781EoFrJZ','12FVQAWy','1677822EScpui','6AUxueN','quoted','\x20got\x20the\x20ultimate\x20pass\x20\x20to\x20use\x20the\x20bot\x20in\x20DM','includes'];_0x3c0e=function(){return _0x3f0664;};return _0x3c0e();}handler[_0x5f30a4(0x111)]=[_0x5f30a4(0x10d)],handler[_0x5f30a4(0x118)]=['owner'],handler[_0x5f30a4(0x10f)]=[_0x5f30a4(0x11b),'makeallow','al'],handler[_0x5f30a4(0x119)]=!![],handler[_0x5f30a4(0x12b)]=!![];export default handler;