/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x51853d=_0x2046;(function(_0x53700f,_0xf9bed8){const _0x28e3cc=_0x2046,_0x532f64=_0x53700f();while(!![]){try{const _0x4d7e83=-parseInt(_0x28e3cc(0x115))/0x1+-parseInt(_0x28e3cc(0x123))/0x2*(parseInt(_0x28e3cc(0x122))/0x3)+-parseInt(_0x28e3cc(0x114))/0x4*(-parseInt(_0x28e3cc(0x117))/0x5)+parseInt(_0x28e3cc(0x11d))/0x6+-parseInt(_0x28e3cc(0x113))/0x7+parseInt(_0x28e3cc(0x120))/0x8+parseInt(_0x28e3cc(0x118))/0x9;if(_0x4d7e83===_0xf9bed8)break;else _0x532f64['push'](_0x532f64['shift']());}catch(_0x21aea0){_0x532f64['push'](_0x532f64['shift']());}}}(_0x3191,0x96187));import{spawn}from'child_process';let handler=async(_0x1354f5,{conn:_0xf9fcba,isROwner:_0x15fe08,text:_0x4b11c5})=>{const _0x265bc2=_0x2046;if(!process[_0x265bc2(0x11f)])throw'Dont:\x20node\x20main.js\x0aDo:\x20node\x20index.js';if(_0xf9fcba[_0x265bc2(0x11b)][_0x265bc2(0x11e)]==_0xf9fcba['user'][_0x265bc2(0x11e)])await _0x1354f5[_0x265bc2(0x119)]('🔄\x20Restarting\x20Bot...\x0a\x20Wait\x20a\x20moment'),process[_0x265bc2(0x11f)]('reset');else throw'eh';};function _0x2046(_0xf69ba9,_0xb0ad2d){const _0x31911b=_0x3191();return _0x2046=function(_0x204646,_0x37cfb7){_0x204646=_0x204646-0x113;let _0x1e3f06=_0x31911b[_0x204646];return _0x1e3f06;},_0x2046(_0xf69ba9,_0xb0ad2d);}handler['help']=[_0x51853d(0x124)],handler[_0x51853d(0x11c)]=[_0x51853d(0x121)],handler[_0x51853d(0x11a)]=['restart'],handler[_0x51853d(0x116)]=!![];export default handler;function _0x3191(){const _0x56b89c=['tags','6999750TTCRNm','jid','send','3911368EaRnod','owner','324963JjKkLg','18UDrmnC','restart','7617757VIEiSs','104jrNaCB','1124730hCmlUm','rowner','213895yXYXHx','9313749RwWNlP','reply','command','user'];_0x3191=function(){return _0x56b89c;};return _0x3191();}