/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x30d8fc=_0x1323;(function(_0x2b37b2,_0x2196d8){const _0x49ef23=_0x1323,_0x54138d=_0x2b37b2();while(!![]){try{const _0x7576e6=parseInt(_0x49ef23(0x1b1))/0x1*(-parseInt(_0x49ef23(0x1af))/0x2)+parseInt(_0x49ef23(0x1a8))/0x3+-parseInt(_0x49ef23(0x1ae))/0x4+parseInt(_0x49ef23(0x1c0))/0x5*(parseInt(_0x49ef23(0x1ba))/0x6)+parseInt(_0x49ef23(0x1bb))/0x7+-parseInt(_0x49ef23(0x1b3))/0x8+-parseInt(_0x49ef23(0x1a9))/0x9*(-parseInt(_0x49ef23(0x1b7))/0xa);if(_0x7576e6===_0x2196d8)break;else _0x54138d['push'](_0x54138d['shift']());}catch(_0x8288e8){_0x54138d['push'](_0x54138d['shift']());}}}(_0x3187,0x22005));import{tmpdir}from'os';import _0x5a5285,{join}from'path';import{readdirSync,statSync,unlinkSync,existsSync,readFileSync,watch}from'fs';const handler=async(_0x3e6a09,{conn:_0x2b3fe2,usedPrefix:_0xe7fc69,__dirname:_0x54027c,args:_0xf98106,text:_0x4ec52e})=>{const _0x1a9420=_0x1323,_0xa795ab=Object['keys'](plugins),_0x285f5e=_0xa795ab[_0x1a9420(0x1c1)](_0x551e74=>_0x551e74[_0x1a9420(0x1bc)](_0x1a9420(0x1b8),''));if(!_0x4ec52e)throw'📌\x20*_Example\x20usage:_*\x0a*#deleteplugin\x20main-menu*';if(!_0x285f5e[_0x1a9420(0x1b5)](_0xf98106[0x0]))return _0x3e6a09[_0x1a9420(0x1aa)](_0x1a9420(0x1b9)+(_0x1a9420(0x1bf)+_0x285f5e[_0x1a9420(0x1c1)](_0x424e09=>'\x20'+_0x424e09)[_0x1a9420(0x1b4)]('\x0a')));const _0x1679e7=join(_0x54027c,_0x1a9420(0x1b0)+_0xf98106[0x0]+_0x1a9420(0x1b8));unlinkSync(_0x1679e7),_0x2b3fe2[_0x1a9420(0x1aa)](_0x3e6a09[_0x1a9420(0x1b6)],'⚠️\x20*_The\x20\x22plugins/'+_0xf98106[0x0]+_0x1a9420(0x1ab),_0x3e6a09);};function _0x3187(){const _0x1a2c94=['.js\x22\x20plugin\x20has\x20been\x20deleted._*','tags','command','614460WADKLx','2hnFNAw','../plugins/','258491rPbTXO','deleteplugin\x20<name>','1545352ExukZZ','join','includes','chat','272710AYAmqQ','.js','*🗃️\x20This\x20plugin\x20doesn\x27t\x20exist!*','12GZkAGA','1471351GwVqIG','replace','help','owner','\x0a•••••••••••••••••••••••••••••••••••••••••••••••••••••••\x0a\x0a','630620qmcrdw','map','437244KVgzQf','45PAPlvs','reply'];_0x3187=function(){return _0x1a2c94;};return _0x3187();}function _0x1323(_0x22fbfb,_0x1a603d){const _0x3187c0=_0x3187();return _0x1323=function(_0x1323f8,_0x21b841){_0x1323f8=_0x1323f8-0x1a8;let _0x1a7491=_0x3187c0[_0x1323f8];return _0x1a7491;},_0x1323(_0x22fbfb,_0x1a603d);}handler[_0x30d8fc(0x1bd)]=[_0x30d8fc(0x1b2)],handler[_0x30d8fc(0x1ac)]=[_0x30d8fc(0x1be)],handler[_0x30d8fc(0x1ad)]=/^(deleteplugin|dp|remove)$/i,handler[_0x30d8fc(0x1be)]=!![];export default handler;