/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x394d82=_0x3229;function _0x5649(){const _0x1e719c=['error.png','help','439490UqNANO','338040dKBWaO','748191GbubDs','*[🔎]\x20give\x20url*','buffer','chat','2FdkNiY','381156xUmYKO','7EiTmka','command','map','2362044YrRcVg','24yNANBx','372105jWMObI','reply','1499301qmsJZQ','341dRAHBq','sendFile'];_0x5649=function(){return _0x1e719c;};return _0x5649();}(function(_0x5f05f2,_0x14c8df){const _0x39d2de=_0x3229,_0x21db15=_0x5f05f2();while(!![]){try{const _0x2d09b1=parseInt(_0x39d2de(0xd4))/0x1*(-parseInt(_0x39d2de(0xd3))/0x2)+parseInt(_0x39d2de(0xe3))/0x3+parseInt(_0x39d2de(0xd9))/0x4*(-parseInt(_0x39d2de(0xda))/0x5)+parseInt(_0x39d2de(0xd8))/0x6*(-parseInt(_0x39d2de(0xd5))/0x7)+parseInt(_0x39d2de(0xe2))/0x8+-parseInt(_0x39d2de(0xdc))/0x9+-parseInt(_0x39d2de(0xe1))/0xa*(-parseInt(_0x39d2de(0xdd))/0xb);if(_0x2d09b1===_0x14c8df)break;else _0x21db15['push'](_0x21db15['shift']());}catch(_0x56e0dd){_0x21db15['push'](_0x21db15['shift']());}}}(_0x5649,0x40f8e));import _0x265798 from'node-fetch';function _0x3229(_0x46f626,_0x4f8882){const _0x564999=_0x5649();return _0x3229=function(_0x3229f8,_0x3df7ce){_0x3229f8=_0x3229f8-0xd3;let _0x4f3b53=_0x564999[_0x3229f8];return _0x4f3b53;},_0x3229(_0x46f626,_0x4f8882);}let handler=async(_0x4671be,{conn:_0x24859a,command:_0x3e11f9,args:_0x2752b2})=>{const _0x48091f=_0x3229;if(!_0x2752b2[0x0])return _0x24859a[_0x48091f(0xdb)](_0x4671be[_0x48091f(0xe6)],_0x48091f(0xe4),_0x4671be);let _0xd01741=await(await _0x265798('https://image.thum.io/get/fullpage/'+_0x2752b2[0x0]))[_0x48091f(0xe5)]();_0x24859a[_0x48091f(0xde)](_0x4671be[_0x48091f(0xe6)],_0xd01741,_0x48091f(0xdf),_0x2752b2[0x0],_0x4671be);};handler[_0x394d82(0xe0)]=['ss','ssf'][_0x394d82(0xd7)](_0x240096=>_0x240096+'\x20<url>'),handler['tags']=['tools'],handler[_0x394d82(0xd6)]=/^ss(web)?f?$/i;export default handler;