/*
//══════════════════════════════════════════════════════════════════════════════════════════════════════//
//                                                                                                      //
//                                ＷＨＡＴＳＡＰＰ ＢＯＴ－ＭＤ                                             // 
//                                                                                                      // 
//                                         Ｖ：１．０                                                    // 
//                                                                                                      // 
//                                                                                                      //
//         ██████ ██    ██  ██████  ███    ██ ██    ██ ███████       ██████   ██████  ████████          //
//        ██       ██  ██  ██       ████   ██ ██    ██ ██            ██   ██ ██    ██    ██             //
//        ██        ████   ██   ███ ██ ██  ██ ██    ██ ███████ █████ ██████  ██    ██    ██             //   
//        ██         ██    ██    ██ ██  ██ ██ ██    ██      ██       ██   ██ ██    ██    ██             //  
//         ██████    ██     ██████  ██   ████  ██████  ███████       ██████   ██████     ██             //  
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//                                                                                                      //
//══════════════════════════════════════════════════════════════════════════════════════════════════════//

*
   * @project_name : CYGNUS-BOT
   * @author : CODERXSA
   * @youtube : https://www.youtube.com/coderxsa
   * @description : My Private build i made public for everone to use and easy hosting.
   * @version 1.0
*
   * Licensed under the  GPL-3.0 License;
* 
   * Created By CODERX.
   * © 2024 CYGNUS-BOT.
*/




//══════════════════════════════════════════════════════════════════════════════════════════════════════//

const _0x4f0fdf=_0x2085;function _0x2085(_0x1ce851,_0x33231e){const _0x806dcb=_0x806d();return _0x2085=function(_0x2085c0,_0x3a71aa){_0x2085c0=_0x2085c0-0xcf;let _0x2b3eec=_0x806dcb[_0x2085c0];return _0x2b3eec;},_0x2085(_0x1ce851,_0x33231e);}(function(_0x484b37,_0x15061e){const _0x3a7c64=_0x2085,_0x589978=_0x484b37();while(!![]){try{const _0x4a6262=-parseInt(_0x3a7c64(0xdd))/0x1+-parseInt(_0x3a7c64(0xd2))/0x2+parseInt(_0x3a7c64(0xd1))/0x3*(parseInt(_0x3a7c64(0xcf))/0x4)+parseInt(_0x3a7c64(0xd6))/0x5+-parseInt(_0x3a7c64(0xe7))/0x6*(parseInt(_0x3a7c64(0xe6))/0x7)+parseInt(_0x3a7c64(0xd5))/0x8+-parseInt(_0x3a7c64(0xdc))/0x9*(-parseInt(_0x3a7c64(0xe1))/0xa);if(_0x4a6262===_0x15061e)break;else _0x589978['push'](_0x589978['shift']());}catch(_0x399d8c){_0x589978['push'](_0x589978['shift']());}}}(_0x806d,0x2518d));import _0x451ba3 from'node-fetch';let handler=async(_0x6108c7,{conn:_0x4730a9})=>{const _0x4206f7=_0x2085;try{let _0x15ca9b=await _0x451ba3(_0x4206f7(0xd0));if(!_0x15ca9b['ok'])throw await _0x15ca9b['text']();let _0x1814bc=await _0x15ca9b[_0x4206f7(0xe5)]();if(!_0x1814bc[_0x4206f7(0xe4)]||_0x1814bc['courses']['length']<0x5)throw _0x4206f7(0xe0);let _0x316b52='•─────\x20୨❀୧\x20─────•\x0a';for(let _0x450be2=0x0;_0x450be2<0x5;_0x450be2++){let _0x30768c=Math[_0x4206f7(0xe9)](Math['random']()*_0x1814bc[_0x4206f7(0xe4)][_0x4206f7(0xd8)]),_0x1befc5=_0x1814bc[_0x4206f7(0xe4)][_0x30768c];_0x1814bc[_0x4206f7(0xe4)][_0x4206f7(0xdf)](_0x30768c,0x1),_0x316b52+=_0x4206f7(0xde)+_0x1befc5[_0x4206f7(0xe3)]+_0x4206f7(0xda)+_0x1befc5['udemyLink']+'\x0a\x0a';}_0x316b52+=_0x4206f7(0xd3),_0x4730a9[_0x4206f7(0xd4)](_0x6108c7[_0x4206f7(0xea)],_0x316b52,_0x6108c7),_0x6108c7[_0x4206f7(0xeb)]('🤩');}catch(_0x22fe13){console[_0x4206f7(0xd9)](_0x22fe13),_0x6108c7[_0x4206f7(0xeb)](_0x4206f7(0xd9));}};handler[_0x4f0fdf(0xe2)]=[_0x4f0fdf(0xe8),_0x4f0fdf(0xd7)],handler[_0x4f0fdf(0xdb)]=['tools'],handler['command']=[_0x4f0fdf(0xe8),_0x4f0fdf(0xd7)];function _0x806d(){const _0x2fa646=['213029cleDCP','❖\x20Course:\x20','splice','Not\x20enough\x20courses\x20found','3763570hIGhfJ','help','name','courses','json','1917930GhSIOy','6himDTL','course','floor','chat','react','40zwjmRQ','https://eduscout.vercel.app/api/courses','46473DDIMAv','537948VJYTNc','•─────\x20୨❀୧\x20─────•','reply','1618392oTwJom','871880pxXnCh','randomcourse','length','error','\x0a❖\x20Link:\x20','tags','9gTEqOT'];_0x806d=function(){return _0x2fa646;};return _0x806d();}export default handler;